samples/notebook.tex
% Created 2024-03-21 Thu 10:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{gnn}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={gnn},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Keeping an Electronic Lab Notebook with Emacs Org Mode}
\label{sec:org052189f}

Laboratory notebooks have a particular format and set of
requirements.  The first is to have proper dates, and titles for each
entry.  As such I have (for now) settled on the following format:

\section{{\bfseries\sffamily EXPERIMENT} \textit{<31 Aug 2023>} Title\hfill{}\textsc{in\_progress}}
\label{sec:org3ec6933}
Each entry starts with the state of the experiment (EXPERIMENT,
COMPLETE, FAILED) and then the date that the entry was added.  The
date has the month spelled out, to remove the whole
number/number/number ambiguity.  This is followed by the title because
the dates keep the formatting nicely static and don't produce a ragged
left edge.  Each experiment has a tag (not\textsubscript{started}, in\textsubscript{progress},
complete) at the right edge (as dictated by org mode tag formatting).
The tags aren't necessary but are helpful to me in finding where I am
with many different experiments in a single notebook.

Work is clocked using org mode clock tables (see 3 lines following the
title) using C-c C-x C-i (clock in) and C-c C-x C-o (clock out).  When
an experiment is complete it is marked DONE and the clocks are
summarized.  At this point a discrete, signed, checkin is made to
complete the entry.

\subsection{Modified settings and variables for ELNs}
\label{sec:org6c98976}

The following changes are in my .emacs file for use with ELNs

\subsubsection{Change dates to display as 01 Jan 1970 with the month in characters}
\label{sec:orgc9ce35e}

;; Setup an org mode custom date to match for ELNs

(setq-default org-display-custom-times t)
(setq org-time-stamp-custom-formats '("<\%e \%b \%Y>" . "<\%e \%b \%Y \%H:\%M>"))

\subsection{Example Entry}
\label{sec:org5f202f1}

\subsubsection{\textit{< 1 Sep 2023>} Getting the time in user space\hfill{}\textsc{in\_progress}}
\label{sec:org8eaef4c}

\begin{enumerate}
\item Hypothesis
\label{sec:org9e36f4d}

What are you trying to show?  Be specific about what you are
measuring: time, transactions, size of data, latency etc.

\item How
\label{sec:org7e122f8}

(Procedures, calculations, equipment)

\begin{itemize}
\item The Details of How

\item Equipment::CPU, Memory, Disk, Network features and base performance
characteristics

\item Software::Name, Version, Options

\item Scaffolding Scripts, Executables::Location, name, command arguments
passed

\item Commands Typed:Use the script(1) command before you start any
interactive session that will run test or other measurement code.
This command captures all commands typed and their output for later
use.
\end{itemize}

\item Observations
\label{sec:orgc0bebb0}

\begin{itemize}
\item Describe all that happens (planned or unplanned) during the
experiment in narrative text.

\item Raw experimental data::Tables and other data that are small enough
to fit directly into the notes may be place in this section.

\item Large Output Files::Point to the files, signed and stored in a repo,
that contain any relevant output.
\end{itemize}

Org mode has a way to strike out text, C-c C-x C-f + which inserts
plus mark characters that make a strikeout as in the following line:

\sout{- This idea did not work out and therefore is struck out.}

In a Laboratory notebook we NEVER remove ideas, we leave them and
strike them out.  Yes, we can recover text via the version control
system but that's not suffiicent for our purpose, we need to have the
strikeouts remain to work as a real lab notebook.

\item Data analysis
\label{sec:org35080be}

Processing of raw data, graphs, interpretations

\begin{itemize}
\item Summarize your interpretation of the results of the experiment in
narrative text.

\item Summary tables, graphs, images, etc. may be placed directly into the
notes.

\item Large Tables, Graphs, Images etc.::Point to the files, signed and
stored in a repo, that contain any relevant output.
\end{itemize}

\item Ideas for future experiments
\label{sec:org2eaf3e4}

\begin{itemize}
\item A list of further experiments that you believe that tease out new
information.
\end{itemize}
\end{enumerate}
\end{document}

%%% Local Variables:
%%% mode: LaTeX
%%% TeX-master: t
%%% End:
